app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
SELECT "kennels".* FROM "kennels" WHERE "kennels"."customer_id" = $1  [["customer_id", 6]]
---
  def admin
    @customers = Customer.all
    @associatedInfo = @customers.map{ |cus| {customer: cus, kennel: cus.kennels} }

INSERT INTO "customers" ("name", "number", "email", "city", "created_at", "updated_at", "address", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    binding.pry
    @customer = Customer.new(customer_params)
    binding.pry
    if @customer && @customer.authenticate(params[:customer][:password])
    respond_to do |format|
      if @customer.save